pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxPort_reg.h
/** \brief FC, Port 33 Access Enable Register 0 */
#define P33_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C1FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_P_Registers_Cfg_P34
 * \{  */
/** \brief 0, Port 34 Output Register */
#define P34_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OUT*)0xF003C200u)

/** \brief 4, Port 34 Output Modification Register */
#define P34_OMR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMR*)0xF003C204u)

/** \brief 8, Port 34 Identification Register */
#define P34_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ID*)0xF003C208u)

/** \brief 10, Port 34 Input/Output Control Register 0 */
#define P34_IOCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR0*)0xF003C210u)

/** \brief 24, Port 34 Input Register */
#define P34_IN /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IN*)0xF003C224u)

/** \brief 40, Port 34 Pad Driver Mode Register 0 */
#define P34_PDR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR0*)0xF003C240u)

/** \brief 50, Port 34 Emergency Stop Register */
#define P34_ESR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ESR*)0xF003C250u)

/** \brief 60, Port 34 Pin Function Decision Control Register */
#define P34_PDISC /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDISC*)0xF003C260u)

/** \brief 64, Port 34 Pin Controller Select Register */
#define P34_PCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PCSR*)0xF003C264u)

/** \brief 70, Port 34 Output Modification Set Register 0 */
#define P34_OMSR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR0*)0xF003C270u)

/** \brief 80, Port 34 Output Modification Clear Register 0 */
#define P34_OMCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR0*)0xF003C280u)

/** \brief 90, Port 34 Output Modification Set Register */
#define P34_OMSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR*)0xF003C290u)

/** \brief 94, Port 34 Output Modification Clear Register */
#define P34_OMCR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR*)0xF003C294u)

/** \brief F8, Port 34 Access Enable Register 1 */
#define P34_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C2F8u)

/** \brief FC, Port 34 Access Enable Register 0 */
#define P34_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C2FCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXPORT_REG_H */
